# Напишите однострочный генератор словаря, который принимает на вход три списка одинаковой длины: 
# имена str, ставка int, премия str с указанием процентов вида “10.25%”. 
# В результате получаем словарь с именем в качестве ключа и суммой премии в качестве значения. 
# Сумма рассчитывается как ставка умноженная на процент премии

names = ['Adam', 'Bob', 'Steven']
salaries = [30000, 50000, 80000]
bonuses = ['10.25%', '12.44%', '8.72%']

result = {name: round(salary * float(bonus[:-1]) / 100, 2) for name, salary, bonus in zip(names, salaries, bonuses)}

print(result)
